[
  {
    "path": "posts/06_18_21_second/",
    "title": "What does elo measure?",
    "description": "A definition of elo rating. An analysis of a chess game of mine. An inaugural \nentry in an amateur chess diary, if you will.",
    "author": [
      {
        "name": "James Carzon",
        "url": "https://jamescarzon.github.io/"
      }
    ],
    "date": "2021-06-21",
    "categories": [],
    "contents": "\r\nIt is imperative that you establish your chess skill level as soon as possible. There is simply too much at stake to live your 21st century life in tactical darkness. If you seriously think that you can walk around inside this world with nothing but the minimal knowledge of how the pieces move and still hold your head high at night, then you’ve already lost. Mark my words, you will be the one left sitting on the curb outside Pizza Hut with your confidence shattered and your carpal tunnels throbbing while a confederacy of twelve-year-olds will be standing around you with their hands making knight-jump-shapes on their acne-ridden foreheads. There is no coming back from this disaster.\r\nAs a kid, I did not believe myself to be mathematically competent, let alone gifted, and I assumed that good play of chess required some sort of talent. When I started playing chess in college, I marvelled at my opponents’ good fortune. I thought to myself as I lost time and again, I’d done nothing wrong! I traded pieces for pieces, I didn’t walk into check, and I kept my queen next to my king! How could I have lost?\r\nThe circumstances of the COVID-19 pandemic kindled a change in my attitude about the game. I found it to be an opportune activity to share remotely with my friends and a skill in which I was certainly capable of improving. The practice of learning to play better chess (as opposed to the practice itself of playing chess) is very satisfying now, because I no longer embarrass myself and have a renewed admiration for my ability to cling to mediocrity in a broad range of skills in which most people either find great success or total disdain.\r\n\r\n\r\nElo as a proxy for skill\r\nDon’t trot out the queen\r\nPlaying chess like you care\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-03T21:22:22-04:00",
    "input_file": "second.knit.md"
  }
]
